app/controllers/shows_controller.rb

	def index
		@shows = Show.includes(:episodes).where('episodes.airdate > ?', 3.days.ago ).order('airdate ASC')

		@off_air = Show.all.keep_if do |show|
			@shows.select { |s| s.name == show.name }.empty?
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."show_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
SELECT "shows".* FROM "shows" WHERE (airdate > '2012-04-07 20:17:51.822942')
SELECT "shows".* FROM "shows"
SELECT "episodes".* FROM "episodes" WHERE "episodes"."show_id" = 4
SELECT COUNT(*) FROM "episodes" WHERE "episodes"."show_id" = 1

	def create
		require 'tvrage'

		@show = Show.new(params[:show])

		TvRage.sync @show
---
INSERT INTO "shows" ("created_at", "name", "seasons", "tvrage_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 11 Apr 2012 02:26:26 UTC +00:00], ["name", "Once Upon a Time"], ["seasons", 1], ["tvrage_id", "28385"], ["updated_at", Wed, 11 Apr 2012 02:26:26 UTC +00:00]]

	def update
		@show = Show.find(params[:id])

		respond_to do |format|
			if @show.update_attributes({ name: params[:name] })
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "shows" SET "name" = 'The Office', "updated_at" = '2012-04-10 03:27:34.734884' WHERE "shows"."id" = 5

	def destroy
		@show = Show.find(params[:id])

		respond_to do |format|
			if @show.destroy
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "13"]]
DELETE FROM "shows" WHERE "shows"."id" = ?  [["id", 13]]