app/views/shows/_shows.html.erb

SELECT "episodes".* FROM "episodes" WHERE "episodes"."show_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
---
		<ul>
			<% show[:episodes].each do |episode| %>